{
  // ⚠️ CTO-Governance für Rechtstexte - Diese Datei ist unter CTO-Schutz ⚠️
  // Änderungen an den Rechtstexten NUR nach Rücksprache mit dem CTO.
  // Keine automatisierte AI-Bearbeitung ohne explizite Freigabe!
  // Letzte Änderung: Juli 2025 - Vollständige Rechtstexte, DSGVO/Audit-ready
  // Changelog: Alle Legal-Seiten in zentraler legal.json konsolidiert

  "impressum": {
    "title": "Impressum",
    "lastUpdated": "Stand: Juli 2025",
    "intro": "Rechtliche Informationen und Angaben gemäß Telemediengesetz (TMG).",
    "companyInfo": "Angaben gemäß § 5 TMG",
    "company": "matbakh-app",
    "location": "München, Deutschland",
    "contactTitle": "Kontakt",
    "email": "E-Mail: mail(at)matbakh(dot)app",
    "responsibleTitle": "Verantwortlich für den Inhalt",
    "responsible": "matbakh-app",
    "disclaimerTitle": "Haftungsausschluss",
    "disclaimer": "Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich.",
    "linksTitle": "Haftung für Links",
    "linksText": "Unser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen.",
    "copyrightTitle": "Urheberrecht",
    "copyrightText": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers."
  },

  "datenschutz": {
    "title": "Datenschutzerklärung",
    "lastUpdated": "Stand: Juli 2025",
    "intro": "Wir nehmen den Schutz Ihrer persönlichen Daten sehr ernst und behandeln Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.",
    "controllerTitle": "Verantwortliche Stelle",
    "controller": "matbakh-app\nMünchen, Deutschland\nE-Mail: mail(at)matbakh(dot)app",
    "collectionTitle": "Datenerfassung auf unserer Website",
    "collectionText": "Wir erheben und verwenden personenbezogene Daten nur, soweit dies gesetzlich erlaubt ist oder Sie in die Datenerhebung einwilligen.",
    "serverLogsTitle": "Server-Log-Dateien",
    "serverLogsText": "Der Provider der Seiten erhebt und speichert automatisch Informationen in so genannten Server-Log-Dateien, die Ihr Browser automatisch an uns übermittelt. Dies sind: Browsertyp und Browserversion, verwendetes Betriebssystem, Referrer URL, Hostname des zugreifenden Rechners, Uhrzeit der Serveranfrage und IP-Adresse.",
    "googleTitle": "Google Services Integration",
    "googleInfo": "Bei der Nutzung unserer Google Business Services werden folgende Daten verarbeitet:",
    "dataList": [
      "Unternehmensdaten (matbakh-app, Ridlerstraße 29F, 80339, Müncchen, matbakh.app)",
      "Google Account Informationen und Zugriffsberechtigungen",
      "Bewertungen und Kommentare Ihrer Kunden",
      "Fotos und Medieninhalte Ihres Restaurants",
      "Öffnungszeiten und Geschäftsinformationen",
      "Performance-Daten und Analytics"
    ],
    "dataUsage": "Diese Daten werden ausschließlich zur Verwaltung und Optimierung Ihres Google Business Profils verwendet. Eine Weitergabe an Dritte erfolgt nicht, außer zur Erfüllung unserer Dienstleistung über Google APIs.",
    
    "cookiesTitle": "Cookies",
    "cookiesText": "Unsere Website verwendet Cookies zur Verbesserung der Nutzererfahrung. Sie können Ihren Browser so einstellen, dass Sie über das Setzen von Cookies informiert werden und Cookies nur im Einzelfall erlauben.",

    "cookiesConsentTitle": "Cookie-Einwilligung",
    "cookiesConsentText": "Unsere Website verwendet technisch notwendige Cookies sowie – nach Ihrer Einwilligung – weitere Cookies zu Analyse- und Marketingzwecken. Sie können Ihre Cookie-Einstellungen jederzeit über die Cookie-Einstellungen im Footer ändern. Weitere Informationen finden Sie in dieser Datenschutzerklärung.",

    "thirdPartyTitle": "Datenübermittlung an Dritte und in Drittländer",
    "thirdPartyText": "Im Rahmen unserer Dienstleistung können personenbezogene Daten an Google oder andere Drittanbieter übermittelt werden, soweit dies zur Vertragsdurchführung erforderlich ist. Eine Übermittlung in Staaten außerhalb der EU (Drittländer) erfolgt nur, wenn die besonderen Voraussetzungen der Art. 44 ff. DSGVO erfüllt sind.",
    
    "rightsTitle": "Ihre Rechte",
    "rightsText": "Sie haben das Recht auf Auskunft, Berichtigung, Löschung oder Einschränkung der Verarbeitung Ihrer personenbezogenen Daten. Sie können Ihre Einwilligung jederzeit widerrufen. Sie haben zudem das Recht, sich bei einer Datenschutz-Aufsichtsbehörde zu beschweren.",

    "contactTitle": "Datenschutz-Kontakt",
    "contactText": "Bei Fragen zum Datenschutz wenden Sie sich an: mail(at)matbakh(dot)app",

    "disclaimerText": "Diese Datenschutzerklärung ist auf dem Stand von Juli 2025 und kann bei Änderungen unserer Services aktualisiert werden.",

    "changelog": [
      { "date": "2025-07-11", "change": "Ergänzung zu Cookies/Consent, Drittlandübermittlung und Beschwerderecht" }
    ]
  },

  "agb": {
    "title": "Allgemeine Geschäftsbedingungen",
    "lastUpdated": "Stand: Juli 2025",
    "scopeTitle": "§ 1 Geltungsbereich",
    "scopeText": "Diese Allgemeinen Geschäftsbedingungen gelten für alle Verträge zwischen BaSSco (Bavarian Software Solution) und unseren Kunden über die Nutzung unserer Dienstleistungen im Bereich Google Business Management und Social Media Marketing für Restaurants.",
    "servicesTitle": "§ 2 Leistungsumfang",
    "servicesText": "Wir bieten professionelle Dienstleistungen zur Erstellung, Optimierung und Verwaltung von Google Business Profilen sowie Social Media Management für Gastronomiebetriebe. Der genaue Leistungsumfang ergibt sich aus dem jeweiligen Servicepaket.",
    "contractTitle": "§ 3 Vertragsschluss", 
    "contractText": "Der Vertrag kommt durch Ihre Buchung eines Servicepakets und unsere Bestätigung zustande. Wir behalten uns vor, Aufträge abzulehnen.",
    "pricesTitle": "§ 4 Preise und Zahlungsbedingungen",
    "pricesText": "Es gelten die zum Zeitpunkt der Bestellung angezeigten Preise. Die Zahlung erfolgt über Stripe. Bei wiederkehrenden Leistungen wird monatlich abgerechnet.",
    "performanceTitle": "§ 5 Leistungserbringung",
    "performanceText": "Wir erbringen unsere Leistungen mit der Sorgfalt eines ordentlichen Kaufmanns. Die Zusammenarbeit erfordert Ihre Mitwirkung bei der Bereitstellung von Inhalten und Zugangsdaten.",
    "cancellationTitle": "§ 6 Kündigung",
    "cancellationText": "Verträge können mit einer Frist von 30 Tagen zum Monatsende gekündigt werden. Einige Pakete haben eine Mindestlaufzeit von 6 Monaten. Setup-Leistungen sind einmalig und nicht kündbar.",
    "liabilityTitle": "§ 7 Haftung",
    "liabilityText": "Unsere Haftung ist auf Vorsatz und grobe Fahrlässigkeit beschränkt. Die Haftung für entgangenen Gewinn oder indirekte Schäden ist ausgeschlossen. Bei leichter Fahrlässigkeit haften wir nur bei Verletzung wesentlicher Vertragspflichten.",
    "dataTitle": "§ 8 Datenschutz",
    "dataText": "Der Umgang mit Ihren Daten richtet sich nach unserer Datenschutzerklärung, die Bestandteil dieser AGB ist.",
    "finalTitle": "§ 9 Schlussbestimmungen",
    "finalText": "Es gilt deutsches Recht unter Ausschluss der UN-Kaufrechtskonvention. Gerichtsstand ist München. Sollten einzelne Bestimmungen unwirksam sein, bleibt die Wirksamkeit der übrigen Bestimmungen unberührt."
  },

  "nutzung": {
    "title": "Nutzungsbedingungen",
    "lastUpdated": "Stand: Juli 2025",
    "scopeTitle": "§ 1 Geltungsbereich",
    "scopeText": "Diese Nutzungsbedingungen regeln die Verwendung unserer Dienstleistungen und Website. Sie gelten für alle Nutzer unserer Services im Bereich Google Business Management und Social Media Marketing für Restaurants.",
    "servicesTitle": "§ 2 Leistungen",
    "servicesText": "Wir stellen professionelle Google Business Verwaltung und Social Media Management zur Verfügung. Die genauen Leistungen ergeben sich aus der jeweiligen Servicebeschreibung und dem gebuchten Paket.",
    "userRightsTitle": "§ 3 Nutzerrechte",
    "userRightsText": "Sie haben das Recht auf ordnungsgemäße Erbringung unserer Dienstleistungen entsprechend der vereinbarten Spezifikationen. Sie erhalten regelmäßige Reports über die erbrachten Leistungen.",
    "userObligationsTitle": "§ 4 Nutzerpflichten",
    "userObligationsText": "Sie verpflichten sich zur wahrheitsgemäßen Angabe Ihrer Geschäftsdaten und zur rechtzeitigen Bereitstellung der für die Leistungserbringung erforderlichen Informationen und Zugangsdaten.",
    "liabilityTitle": "§ 5 Haftung",
    "liabilityText": "Unsere Haftung ist auf Vorsatz und grobe Fahrlässigkeit beschränkt. Eine Haftung für mittelbare Schäden oder entgangenen Gewinn ist ausgeschlossen, soweit gesetzlich zulässig.",
    "terminationTitle": "§ 6 Kündigung",
    "terminationText": "Der Vertrag kann von beiden Seiten mit einer Frist von 30 Tagen zum Monatsende gekündigt werden. Einmalige Setup-Leistungen sind von der Kündigung ausgenommen.",
    "lawTitle": "§ 7 Anwendbares Recht",
    "lawText": "Es gilt deutsches Recht unter Ausschluss der UN-Kaufrechtskonvention. Gerichtsstand ist München."
  },

  "preise": {
    "title": "Preise und Leistungen",
    "subtitle": "Transparente Preisgestaltung für professionelle Google Business Verwaltung",
    "limitedOffer": "Nur für kurze Zeit",
    "originalPrice": "Normalpreis",
    "currentPrice": "Aktionspreis",
    "monthly": "monatlich",
    "oneTime": "einmalig",
    "minDuration": "Mindestlaufzeit",
    "vatNote": "Alle Preise verstehen sich als Kleinunternehmer gemäß § 19 UStG ohne Umsatzsteuer.",
    "setupPackage": {
      "name": "Google Business Setup",
      "description": "Professionelle Einrichtung Ihres Google Business Profils",
      "duration": "Einmalige Leistung"
    },
    "managementPackage": {
      "name": "Google Business Verwaltung", 
      "description": "Monatliche Pflege und Optimierung Ihres Profils",
      "duration": "Monatlich, mind. 6 Monate"
    },
    "socialPackage": {
      "name": "Social Media Management",
      "description": "Professionelle Betreuung Ihrer Social Media Kanäle", 
      "duration": "Monatlich, mind. 6 Monate"
    },
    "premiumPackage": {
      "name": "Premium Paket",
      "description": "Komplettpaket mit allen Leistungen für 6 Monate",
      "duration": "6 Monate Laufzeit",
      "savings": "Sie sparen 400€"
    },
    "additionalServices": {
      "title": "Zusätzliche Services",
      "uploadFee": "Jedes weitere Upload: 5€",
      "chatbotSetup": "Chatbot Einrichtung verfügbar",
      "socialSetup": "Social Media Kanal Einrichtung möglich"
    },
    "paymentInfo": {
      "title": "Zahlungsinformationen",
      "methods": "Sichere Zahlung über Stripe",
      "billing": "Monatliche Abrechnung bei Abo-Services",
      "cancellation": "Kündigung mit 30 Tagen Frist möglich"
    }
  }
}
