{
  // ⚠️ CTO-Governance for Legal Texts - This file is under CTO protection ⚠️
  // Changes to legal texts ONLY after explicit CTO approval.
  // No automated AI editing without explicit release!
  // Last update: July 2025 – Complete legal texts, GDPR/audit-ready
  // Changelog: All legal pages consolidated into central legal.json

  "imprint": {
    "title": "Imprint",
    "lastUpdated": "Last updated: July 2025",
    "intro": "Legal information and notices according to German Telemedia Act (TMG).",
    "companyInfo": "Information according to § 5 TMG",
    "company": "matbakh-app",
    "location": "Munich, Germany",
    "contactTitle": "Contact",
    "email": "E-Mail: mail(at)matbakh(dot)app",
    "responsibleTitle": "Responsible for content",
    "responsible": "matbakh-app",
    "disclaimerTitle": "Disclaimer",
    "disclaimer": "The contents of our pages were created with the utmost care. However, we cannot guarantee the accuracy, completeness or up-to-dateness of the contents. As a service provider, we are responsible for our own content on these pages according to § 7 para.1 TMG under general law.",
    "linksTitle": "Liability for links",
    "linksText": "Our offer contains links to external third-party websites, the contents of which we have no influence over. Therefore, we cannot accept any liability for these external contents.",
    "copyrightTitle": "Copyright",
    "copyrightText": "The content and works created by the site operators on these pages are subject to German copyright law. Duplication, processing, distribution, and any kind of use beyond the limits of copyright law require the written consent of the respective author or creator."
  },

  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last updated: July 2025",
    "intro": "We take the protection of your personal data very seriously and treat your personal data confidentially and in accordance with statutory data protection regulations as well as this privacy policy.",
    "controllerTitle": "Controller",
    "controller": "matbakh-app\nMunich, Germany\nE-Mail: mail(at)matbakh(dot)app",
    "collectionTitle": "Data collection on our website",
    "collectionText": "We collect and use personal data only insofar as this is permitted by law or you consent to data collection.",
    "serverLogsTitle": "Server log files",
    "serverLogsText": "The provider of these pages automatically collects and stores information in so-called server log files, which your browser automatically transmits to us. These are: browser type and version, operating system used, referrer URL, host name of the accessing computer, time of the server request, and IP address.",
    "googleTitle": "Google Services Integration",
    "googleInfo": "When using our Google Business services, the following data is processed:",
    "dataList": [
      "Business data (matbakh-app, Ridlerstraße 29F, 80339, Munich, matbakh.app)",
      "Google Account information and access permissions",
      "Reviews and comments from your customers",
      "Photos and media content of your restaurant",
      "Opening hours and business information",
      "Performance data and analytics"
    ],
    "dataUsage": "This data is used exclusively to manage and optimize your Google Business profile. Data is not shared with third parties, except as necessary to fulfill our services via Google APIs.",
    
    "cookiesTitle": "Cookies",
    "cookiesText": "Our website uses cookies to improve user experience. You can set your browser to inform you about the setting of cookies and allow cookies only in individual cases.",

    "cookiesConsentTitle": "Cookie Consent",
    "cookiesConsentText": "Our website uses technically necessary cookies as well as – after your consent – additional cookies for analysis and marketing purposes. You can adjust your cookie settings at any time via the cookie settings link in the footer. Further information can be found in this privacy policy.",

    "thirdPartyTitle": "Transfer of data to third parties and third countries",
    "thirdPartyText": "In the course of providing our services, personal data may be transferred to Google or other third-party providers, as far as required for contractual performance. Data transfers to countries outside the EU (third countries) only occur if the specific requirements of Art. 44 ff. GDPR are met.",
    
    "rightsTitle": "Your rights",
    "rightsText": "You have the right to access, rectification, erasure, or restriction of processing of your personal data. You may revoke your consent at any time. You also have the right to lodge a complaint with a data protection supervisory authority.",

    "contactTitle": "Data Protection Contact",
    "contactText": "If you have any questions about data protection, please contact: mail(at)matbakh(dot)app",

    "disclaimerText": "This privacy policy is current as of July 2025 and may be updated if our services change.",

    "changelog": [
      { "date": "2025-07-11", "change": "Added cookies/consent, third-country transfer, and complaint rights" }
    ]
  },

  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "Last updated: July 2025",
    "scopeTitle": "§ 1 Scope",
    "scopeText": "These Terms of Service apply to all contracts between BaSSco (Bavarian Software Solution) and our customers regarding the use of our services in the field of Google Business management and social media marketing for restaurants.",
    "servicesTitle": "§ 2 Scope of Services",
    "servicesText": "We provide professional services for the creation, optimization, and management of Google Business profiles as well as social media management for the hospitality industry. The exact scope of services is determined by the respective service package.",
    "contractTitle": "§ 3 Conclusion of Contract",
    "contractText": "The contract is concluded by your booking of a service package and our confirmation. We reserve the right to refuse orders.",
    "pricesTitle": "§ 4 Prices and Payment Terms",
    "pricesText": "The prices displayed at the time of the order apply. Payment is processed via Stripe. For recurring services, billing is monthly.",
    "performanceTitle": "§ 5 Performance",
    "performanceText": "We perform our services with the care of a prudent businessman. Cooperation requires your participation in providing content and access data.",
    "cancellationTitle": "§ 6 Termination",
    "cancellationText": "Contracts can be terminated with 30 days' notice to the end of the month. Some packages have a minimum term of 6 months. Setup services are one-time and non-cancellable.",
    "liabilityTitle": "§ 7 Liability",
    "liabilityText": "Our liability is limited to intent and gross negligence. Liability for loss of profit or indirect damages is excluded. In cases of minor negligence, we are liable only for breaches of essential contractual obligations.",
    "dataTitle": "§ 8 Data Protection",
    "dataText": "The handling of your data is governed by our privacy policy, which is part of these terms.",
    "finalTitle": "§ 9 Final Provisions",
    "finalText": "German law applies, excluding the UN Convention on Contracts for the International Sale of Goods. The place of jurisdiction is Munich. Should individual provisions be invalid, the validity of the remaining provisions remains unaffected."
  },

  "usage": {
    "title": "Terms of Use",
    "lastUpdated": "Last updated: July 2025",
    "scopeTitle": "§ 1 Scope",
    "scopeText": "These Terms of Use govern the use of our services and website. They apply to all users of our Google Business management and social media marketing services for restaurants.",
    "servicesTitle": "§ 2 Services",
    "servicesText": "We provide professional Google Business management and social media management. The exact services are specified in the service description and selected package.",
    "userRightsTitle": "§ 3 User Rights",
    "userRightsText": "You are entitled to proper provision of our services as agreed. You will receive regular reports on the services provided.",
    "userObligationsTitle": "§ 4 User Obligations",
    "userObligationsText": "You are obliged to provide truthful business data and to supply all information and access data required for performance in good time.",
    "liabilityTitle": "§ 5 Liability",
    "liabilityText": "Our liability is limited to intent and gross negligence. Liability for indirect damages or loss of profit is excluded to the extent permitted by law.",
    "terminationTitle": "§ 6 Termination",
    "terminationText": "The contract may be terminated by either party with 30 days' notice to the end of the month. One-time setup services are excluded from termination.",
    "lawTitle": "§ 7 Applicable Law",
    "lawText": "German law applies, excluding the UN Convention on Contracts for the International Sale of Goods. Place of jurisdiction is Munich."
  },

  "pricing": {
    "title": "Pricing & Services",
    "subtitle": "Transparent pricing for professional Google Business management",
    "limitedOffer": "Limited time only",
    "originalPrice": "Regular price",
    "currentPrice": "Promotional price",
    "monthly": "monthly",
    "oneTime": "one-time",
    "minDuration": "Minimum duration",
    "vatNote": "All prices are exempt from VAT according to § 19 UStG (German VAT law).",
    "setupPackage": {
      "name": "Google Business Setup",
      "description": "Professional setup of your Google Business profile",
      "duration": "One-time service"
    },
    "managementPackage": {
      "name": "Google Business Management", 
      "description": "Monthly maintenance and optimization of your profile",
      "duration": "Monthly, min. 6 months"
    },
    "socialPackage": {
      "name": "Social Media Management",
      "description": "Professional management of your social media channels", 
      "duration": "Monthly, min. 6 months"
    },
    "premiumPackage": {
      "name": "Premium Package",
      "description": "Complete package with all services for 6 months",
      "duration": "6 months term",
      "savings": "You save €400"
    },
    "additionalServices": {
      "title": "Additional services",
      "uploadFee": "Each additional upload: €5",
      "chatbotSetup": "Chatbot setup available",
      "socialSetup": "Social media channel setup possible"
    },
    "paymentInfo": {
      "title": "Payment information",
      "methods": "Secure payment via Stripe",
      "billing": "Monthly billing for subscription services",
      "cancellation": "Cancellable with 30 days' notice"
    }
  },

  "contact": {
    "title": "Contact",
    "lastUpdated": "Last updated: July 2025",
    "contactTitle": "Contact",
    "contactText": "You can reach us at:\nEmail: mail(at)matbakh(dot)app\nAddress: Munich, Germany",
    "disclaimerText": "This imprint also applies to all subdomains and social media profiles."
  }
}
