{
  // ⚠️ CTO-Governance for Legal Texts - This file is under CTO protection ⚠️
  // Changes to legal texts ONLY after consultation with the CTO.
  // No automated AI editing without explicit approval!
  // Last change: January 2025 - Complete legal texts implemented
  // Changelog: All legal pages consolidated in central legal.json
  "imprint": {
    "title": "Imprint",
    "companyInfo": "Information according to § 5 TMG",
    "company": "matbakh-app",
    "location": "Munich, Germany",
    "contactTitle": "Contact",
    "email": "Email: mail(at)matbakh(dot)app",
    "responsibleTitle": "Responsible for content",
    "responsible": "matbakh-app",
    "disclaimerTitle": "Disclaimer",
    "disclaimer": "The contents of our pages have been created with the greatest care. However, we cannot guarantee the accuracy, completeness and timeliness of the content. As service providers, we are responsible for our own content on these pages according to general laws in accordance with § 7 para.1 TMG.",
    "linksTitle": "Liability for links",
    "linksText": "Our offer contains links to external websites of third parties over whose content we have no influence. Therefore, we cannot assume any liability for this external content.",
    "copyrightTitle": "Copyright",
    "copyrightText": "The content and works created by the site operators on these pages are subject to German copyright law. Duplication, processing, distribution and any form of commercialization outside the scope of copyright require the written consent of the respective author or creator."
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last updated: January 2025",
    "intro": "We take the protection of your personal data very seriously and treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy.",
    "controllerTitle": "Data Controller",
    "controller": "matbakh-app\nMunich, Germany\nEmail: mail(at)matbakh(dot)app",
    "collectionTitle": "Data collection on our website",
    "collectionText": "We collect and use personal data only to the extent permitted by law or if you consent to data collection.",
    "serverLogsTitle": "Server log files",
    "serverLogsText": "The provider of the pages automatically collects and stores information in so-called server log files, which your browser automatically transmits to us. These are: browser type and browser version, operating system used, referrer URL, hostname of the accessing computer, time of the server request and IP address.",
    "googleTitle": "Google Services Integration",
    "googleInfo": "When using our Google Business Services, the following data is processed:",
    "dataList": [
      "Business data (matbakh-app, Ridlerstrasse 29F, matbakh.app)",
      "Google Account information and access permissions",
      "Customer reviews and comments",
      "Photos and media content of your restaurant",
      "Opening hours and business information",
      "Performance data and analytics"
    ],
    "dataUsage": "This data is used exclusively for managing and optimizing your Google Business profile. No data is shared with third parties, except for providing our service through Google APIs.",
    "rightsTitle": "Your rights",
    "rightsText": "You have the right to information, correction, deletion or restriction of the processing of your personal data. You can revoke your consent at any time.",
    "contactTitle": "Privacy contact",
    "contactText": "For questions about data protection, please contact: mail(at)matbakh(dot)app",
    "cookiesTitle": "Cookies",
    "cookiesText": "Our website uses cookies to improve the user experience. You can set your browser to be informed about the setting of cookies and allow cookies only in individual cases.",
    "disclaimerText": "This privacy policy is current as of July 2025 and may be updated if our services change."
  },
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "Last updated: July 2025",
    "scopeTitle": "§ 1 Scope",
    "scopeText": "These General Terms and Conditions apply to all contracts between BaSSco (Bavarian Software Solution) and our customers regarding the use of our services in the field of Google Business management and social media marketing for restaurants.",
    "servicesTitle": "§ 2 Scope of services",
    "servicesText": "We offer professional services for creating, optimizing and managing Google Business profiles as well as social media management for restaurant businesses. The exact scope of services is determined by the respective service package.",
    "contractTitle": "§ 3 Contract conclusion",
    "contractText": "The contract is concluded by your booking of a service package and our confirmation. We reserve the right to refuse orders.",
    "pricesTitle": "§ 4 Prices and payment terms",
    "pricesText": "The prices displayed at the time of ordering apply. Payment is made via Stripe. For recurring services, billing is monthly.",
    "performanceTitle": "§ 5 Service provision",
    "performanceText": "We provide our services with the care of a prudent businessman. The cooperation requires your collaboration in providing content and access data.",
    "cancellationTitle": "§ 6 Termination",
    "cancellationText": "Contracts can be terminated with 30 days' notice to the end of the month. Some packages have a minimum term of 6 months. Setup services are one-time and not cancellable.",
    "liabilityTitle": "§ 7 Liability",
    "liabilityText": "Our liability is limited to intent and gross negligence. Liability for lost profits or indirect damages is excluded. In case of slight negligence, we are only liable for breach of essential contractual obligations.",
    "dataTitle": "§ 8 Data protection",
    "dataText": "The handling of your data is governed by our privacy policy, which is part of these terms and conditions.",
    "finalTitle": "§ 9 Final provisions",
    "finalText": "German law applies, excluding the UN Convention on Contracts for the International Sale of Goods. The place of jurisdiction is Munich. Should individual provisions be invalid, the validity of the remaining provisions remains unaffected."
  },
  "privacy": {
    "lastUpdated": "Last updated: July 2025"
  },
  "terms": {
    "lastUpdated": "Last updated: July 2025"
  },
  "imprint": {
    "lastUpdated": "Last updated: July 2025"
  },
  "usage": {
    "title": "Usage Terms",
    "lastUpdated": "Last updated: July 2025",
    "scopeTitle": "§ 1 Scope",
    "scopeText": "These usage terms govern the use of our services and website. They apply to all users of our services in the field of Google Business management and social media marketing for restaurants.",
    "servicesTitle": "§ 2 Services", 
    "servicesText": "We provide professional Google Business management and social media management. The exact services are defined in the respective service description and booked package.",
    "userRightsTitle": "§ 3 User Rights",
    "userRightsText": "You have the right to proper provision of our services according to the agreed specifications. You will receive regular reports on the services provided.",
    "userObligationsTitle": "§ 4 User Obligations",
    "userObligationsText": "You commit to providing truthful information about your business data and timely provision of information and access data required for service delivery.",
    "liabilityTitle": "§ 5 Liability",
    "liabilityText": "Our liability is limited to intent and gross negligence. Liability for indirect damages or lost profits is excluded to the extent legally permissible.",
    "terminationTitle": "§ 6 Termination",
    "terminationText": "The contract can be terminated by either party with 30 days' notice to the end of the month. One-time setup services are excluded from termination.",
    "lawTitle": "§ 7 Applicable Law",
    "lawText": "German law applies excluding the UN Convention on Contracts for the International Sale of Goods. The place of jurisdiction is Munich."
  },
  "pricing": {
    "title": "Pricing and Services",
    "subtitle": "Transparent pricing for professional Google Business management",
    "limitedOffer": "Limited time offer",
    "originalPrice": "Regular price",
    "currentPrice": "Special price",
    "monthly": "monthly",
    "oneTime": "one-time",
    "minDuration": "Minimum duration",
    "vatNote": "All prices are for small businesses according to § 19 UStG without VAT.",
    "setupPackage": {
      "name": "Google Business Setup",
      "description": "Professional setup of your Google Business profile",
      "duration": "One-time service"
    },
    "managementPackage": {
      "name": "Google Business Management",
      "description": "Monthly maintenance and optimization of your profile",
      "duration": "Monthly, min. 6 months"
    },
    "socialPackage": {
      "name": "Social Media Management",
      "description": "Professional management of your social media channels",
      "duration": "Monthly, min. 6 months"
    },
    "premiumPackage": {
      "name": "Premium Package",
      "description": "Complete package with all services for 6 months",
      "duration": "6 months term",
      "savings": "You save €400"
    },
    "additionalServices": {
      "title": "Additional Services",
      "uploadFee": "Each additional upload: €5",
      "chatbotSetup": "Chatbot setup available",
      "socialSetup": "Social media channel setup possible"
    },
    "paymentInfo": {
      "title": "Payment Information",
      "methods": "Secure payment via Stripe",
      "billing": "Monthly billing for subscription services",
      "cancellation": "Cancellation possible with 30 days notice"
    }
  }
}